---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeleteElementsError
source: html/7dc117c6-e54d-daad-5032-63e23a15c005.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeleteElementsError Property

[Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId DeleteElementsError { get; }
```